# Data Encoding 

- Data encoding is a techique whic is used to conversion of Categorical feature into numerical feature .

- types od Encoding 
   1. Replace() or Map() 
   1. Nominal /One hot encoding (OHE )
   2. Ordinal and leabaling encoding 
   3. target guided ordinal encoding 
   4. get_dummies()

In [2]:
import pandas as pd

### 1.Replace() or Map()

<pre>
1) replace() or map()
In both these functions we pass dict where the categories to be replaced are the keys and the values are the integers with which the categories will be encoded with.

In case we have mor ethan 50 or 100 categories, then this method is not a favorbale option for encoding 
<pre>

In [3]:
df = pd.read_csv('50_Startups.csv')
df.head() # top 5 rows

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [10]:
df.dtypes

R&D Spend          float64
Administration     float64
Marketing Spend    float64
State               object
Profit             float64
dtype: object

In [4]:
## check no of categorical and numerical column in dataset 

numeric_feature = [i for i in df.columns if df[i].dtypes != 'object']
categorical_feature = [i for i in df.columns if df[i].dtypes == 'object']

In [7]:
print ('Numeric column :', numeric_feature  )
print( 'Categorical Column :' ,categorical_feature )

Numeric column : ['R&D Spend', 'Administration', 'Marketing Spend', 'Profit']
Categorical Column : ['State']

In [11]:
df['State'].unique()

array(['New York', 'California', 'Florida'], dtype=object)

In [13]:
df1 = df.copy()
df1.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [12]:
df['State'].value_counts()

New York      17
California    17
Florida       16
Name: State, dtype: int64

In [14]:
## Replace()

df1['State_using_rep'] = df1['State'].replace({'New York':0,'California':1,'Florida':2})
df1['State_using_rep'].value_counts()

0    17
1    17
2    16
Name: State_using_rep, dtype: int64

In [15]:
## Map()

df1['State_using_map'] = df1['State'].map({'New York':0,'California':1,'Florida':2})
df1['State_using_map'].value_counts()

0    17
1    17
2    16
Name: State_using_map, dtype: int64

In [16]:
df1.dtypes

R&D Spend          float64
Administration     float64
Marketing Spend    float64
State               object
Profit             float64
State_using_rep      int64
State_using_map      int64
dtype: object

In [17]:
df.dtypes

R&D Spend          float64
Administration     float64
Marketing Spend    float64
State               object
Profit             float64
dtype: object

### 3) get_dummies()
1) For each category multiple columns will be created(the number of columns created will be same as number of categories in that column). <br>
2) Each row will contain only single occurence of 1, all other values will be 0 for those newly created columns.<br>
3) It returns a dataframe<br>
<pre>
Prod  Prod_A   Prod_B  Prod_C  Prod_D
A       1        0       0       0      
B       0        1       0       0
D       0        0       0       1
A       1        0       0       0
C       0        0       1       0
B       0        1       0       0 
A       1        0       0       0 
</pre>

In [87]:
df3 = df.copy()
df3.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [91]:
df_gd = pd.get_dummies(data = df3 ,columns= ['State'])
df_gd.head()

,R&D Spend,Administration,Marketing Spend,Profit,State_California,State_Florida,State_New York
0,165349.20,136897.80,471784.10,192261.83,0,0,1
1,162597.70,151377.59,443898.53,191792.06,1,0,0
2,153441.51,101145.55,407934.54,191050.39,0,1,0
3,144372.41,118671.85,383199.62,182901.99,0,0,1
4,142107.34,91391.77,366168.42,166187.94,0,1,0

In [92]:
df_gd.dtypes

R&D Spend           float64
Administration      float64
Marketing Spend     float64
Profit              float64
State_California      uint8
State_Florida         uint8
State_New York        uint8
dtype: object

### 1 .Nominal Encoding 


- these techinique used to transfrom categrorical variable that have no intransic ordering into numerical value . that can be used in Machine learning.
- one of the common  method of nominal method is One Hot Encoding = which create binary  vector  for each category in the variable .
    
######  Nominal Encoding:
     - Nominal encoding is a technique used to represent categorical variables where there is no inherent order or ranking among the categories.
     - It assigns a unique integer to each category, but the assigned integers have no ordinal relationship.
       Examples of nominal variables include color (e.g., red, blue, green) or city names.

###### One-Hot Encoding:

     >  One-hot encoding is a technique used to represent categorical variables as binary vectors
         (0 or 1) to indicate the presence or absence of a category.
     > It creates a binary column for each category, and the presence of a category is indicated
        by a 1 in the corresponding column.
     > One-hot encoding is suitable for categorical variables with no ordinal relationship,
        similar to nominal encoding.
     > Examples include gender (e.g., male, female) or country names.
     
     - Disadvantage of OHE = if data set having more categorical variable  , then due to OHE creates lots of categorical feature  and thats why decreses the performance of Model.

In [1]:
import pandas as pd 
import numpy as np 
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

In [54]:
df = pd.DataFrame({'colour':['red' ,'blue' ,'green','green' ,'red','blue']})

In [55]:
# create an instance of OHE

from sklearn.preprocessing import OneHotEncoder

encode = OneHotEncoder(sparse=False)

In [56]:
# fit encode to dataframe  and transform the categorical variable 

encoded_data = encode.fit_transform(df[['colour']])

In [57]:
encoded_data #blue ,green ,red

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 1., 0.],
       [0., 0., 1.],
       [1., 0., 0.]])

In [ ]:

# Create a DataFrame with the encoded data
encoded_df = pd.DataFrame(encoded_data, columns=encoder.get_feature_names_out(['colour']))

# Display the resulting DataFrame
encoded_df.head()

In [ ]:
# concat two data frame 

dff = pd.concat([df,encoded_df] ,axis =1)

dff.head()

###### practice Dataset -2

In [72]:
df = pd.read_csv('tips.csv')

In [73]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [74]:
a = df.groupby('day')['total_bill'].mean()
a

day
Fri     17.151579
Sat     20.441379
Sun     21.410000
Thur    17.682742
Name: total_bill, dtype: float64

In [77]:
from sklearn.preprocessing import OneHotEncoder

In [78]:
# create an instance of OHE

encoded = OneHotEncoder(sparse=False )

In [79]:
# fit encode to dataframe  and transform the categorical variable 

encoded_data = encoder.fit_transform(df[['sex', 'smoker', 'day', 'time']])


encoded_data
# Female ,Male ,no ,yes,sun,thur,fri,sat ,Dinner ,Lunch   = encoding occur according thses sequenc of feature

array([[0., 0., 0., 1., 0., 0.],
       [1., 0., 0., 1., 0., 0.],
       [1., 0., 0., 1., 0., 0.],
       ...,
       [1., 1., 1., 0., 0., 0.],
       [1., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0.]])

In [81]:
# convert encoded data into  Data FRame 


encoded_df = pd.DataFrame(encoded_data , columns = encoder.get_feature_names_out(['sex', 'smoker', 'day', 'time']))

encoded_df.head()

   sex_Male  smoker_Yes  day_Sat  day_Sun  day_Thur  time_Lunch
0       0.0         0.0      0.0      1.0       0.0         0.0
1       1.0         0.0      0.0      1.0       0.0         0.0
2       1.0         0.0      0.0      1.0       0.0         0.0
3       1.0         0.0      0.0      1.0       0.0         0.0
4       0.0         0.0      0.0      1.0       0.0         0.0

In [85]:
encoder = OneHotEncoder(sparse=False )

# Fit and transform the selected columns
encoded_data = encoder.fit_transform(df[['sex', 'smoker', 'day', 'time']])

# Create a DataFrame with the encoded data
encoded_df = pd.DataFrame(encoded_data, columns=encoder.get_feature_names_out(['sex', 'smoker', 'day', 'time']))

# Display the resulting DataFrame
encoded_df.head()

,sex_Female,sex_Male,smoker_No,smoker_Yes,day_Fri,day_Sat,day_Sun,day_Thur,time_Dinner,time_Lunch
0,1.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0
1,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0
2,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0
3,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0
4,1.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0

In [66]:
## # Concatenate the new one-hot encoded DataFrame with the original DataFrame

dff = pd.concat([df, encoded_df ], axis=1)

dff.head()

,total_bill,tip,sex,smoker,day,time,size,sex_Male,smoker_Yes,day_Sat,day_Sun,day_Thur,time_Lunch
0,16.99,1.01,Female,No,Sun,Dinner,2,0.0,0.0,0.0,1.0,0.0,0.0
1,10.34,1.66,Male,No,Sun,Dinner,3,1.0,0.0,0.0,1.0,0.0,0.0
2,21.01,3.50,Male,No,Sun,Dinner,3,1.0,0.0,0.0,1.0,0.0,0.0
3,23.68,3.31,Male,No,Sun,Dinner,2,1.0,0.0,0.0,1.0,0.0,0.0
4,24.59,3.61,Female,No,Sun,Dinner,4,0.0,0.0,0.0,1.0,0.0,0.0

##### practice Dataset = 3

In [69]:
# load dataset 

df = pd.read_excel('flight_price.xlsx')

df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [70]:
df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [71]:
df['Source'].unique()

array(['Banglore', 'Kolkata', 'Delhi', 'Chennai', 'Mumbai'], dtype=object)

In [ ]:
df['Total_Stops'].unique()

In [ ]:
from sklearn.preprocessing import OneHotEncoder

In [ ]:
encoded = OneHotEncoder(sparse = False)

In [ ]:
encoded_data = encoded.fit_transform(df[['Airline' ,'Source','Total_Stops']])

In [ ]:
encoded_df = pd.DataFrame(encoded_data ,columns = encoder.get_feature_names_out(['Airline' ,'Source','Total_Stops']))

## ordinal Encoding 

 1.  Definition: Ordinal encoding is used when the categorical data has an inherent order or ranking.
 2. Example: Consider a dataset with an "Education" column containing categories like "High School," "Bachelor's Degree," "Master's Degree," and "Ph.D." Each category has a clear order, and this order is meaningful.
 3. Implementation: Assign numerical values to categories based on their order. For example, you might assign 1 to "High School," 2 to "Bachelor's Degree," and so on.
 

education_mapping = {"High School": 1, "Bachelor's Degree": 2, "Master's Degree": 3, "Ph.D.": 4}
df['Education'] = df['Education'].map(education_mapping)

In [20]:
import pandas as pd 
from sklearn.preprocessing import OrdinalEncoder

In [21]:
df = pd.DataFrame({'size':['small','medium','large','small','medium','large']})

In [22]:
df

     size
0   small
1  medium
2   large
3   small
4  medium
5   large

In [24]:
# create an instance of the ordinalEncoder class and fi_transform

encoder = OrdinalEncoder(categories=[['small','medium','large']])

In [25]:
encoded_data = encoder.fit_transform(df[['size']])

In [26]:
# convert encoded Data into Dataframe

encoded_df = pd.DataFrame(encoded_data , columns = ['encoded_size'])

encoded_df.head()

   encoded_size
0           0.0
1           1.0
2           2.0
3           0.0
4           1.0

In [27]:
# concate encoded data with original data 

dff = pd.concat([df,encoded_df],axis =1 )
dff.head()

     size  encoded_size
0   small           0.0
1  medium           1.0
2   large           2.0
3   small           0.0
4  medium           1.0

###### practice Datset-2

In [30]:
df = pd.read_csv('Bollywood_Movies_Dataset.csv')

In [31]:
df.head()

             Movie_Name BO_Collection  Budget Box_Office_Verdict
0  Pyaar Ka Punchnama 2         53.25    25.0                Hit
1             Shandaar          38.28    68.0               Flop
2      Singh is Bliing         74.87     92.0               Flop
3               Jazbaa           24.3    30.0               Flop
4                Talvar            24    22.0               Plus

In [32]:
unique_values = df['Box_Office_Verdict'].unique()
print(unique_values)

['Hit' 'Flop' 'Plus' 'Average' 'All Time Blockbuster' 'Super Hit'
 'Blockbuster' 'Disaster' 'Semi Hit']

In [41]:
# create instance of ordinaldata encder 

from sklearn.preprocessing import OrdinalEncoder

encoder = OrdinalEncoder(categories = [['Hit', 'Flop', 'Plus', 'Average', 'All Time Blockbuster' ,'Super Hit'
, 'Blockbuster', 'Disaster', 'Semi Hit']])

encoded_data = encoder.fit_transform(df[['Box_Office_Verdict']])

In [34]:
## convert encoded data into dataframe 

encoded_df = pd.DataFrame(encoded_data, columns=['Box_Office_Verdict_Encoded'])
encoded_df.head()

   Box_Office_Verdict_Encoded
0                         0.0
1                         1.0
2                         1.0
3                         1.0
4                         2.0

In [35]:
unique_values = encoded_df['Box_Office_Verdict_Encoded'].unique()
print(unique_values)

[0. 1. 2. 3. 4. 5. 6. 7. 8.]

In [36]:
# concatenate encoded dataframe and original Dataframe

dff = pd.concat([df,encoded_df], axis =1)
dff.head()

,Movie_Name,BO_Collection,Budget,Box_Office_Verdict,Box_Office_Verdict_Encoded
0,Pyaar Ka Punchnama 2,53.25,25.0,Hit,0.0
1,Shandaar,38.28,68.0,Flop,1.0
2,Singh is Bliing,74.87,92.0,Flop,1.0
3,Jazbaa,24.3,30.0,Flop,1.0
4,Talvar,24,22.0,Plus,2.0

## Lebal Encoding 

1. Definition: Label encoding is used when the categorical data doesn't have an inherent order, and the numerical representation is for identification purposes only.
2. Example: Consider a "Color" column with categories like "Red," "Green," and "Blue." These colors don't have a meaningful order.
3. Implementation: Assign a unique numerical label to each category. The assignment is arbitrary and doesn't imply any specific order.


from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['Color'] = le.fit_transform(df['Color'])

In [42]:
df = pd.read_csv('Bollywood_Movies_Dataset.csv')

In [43]:
df.head()

             Movie_Name BO_Collection  Budget Box_Office_Verdict
0  Pyaar Ka Punchnama 2         53.25    25.0                Hit
1             Shandaar          38.28    68.0               Flop
2      Singh is Bliing         74.87     92.0               Flop
3               Jazbaa           24.3    30.0               Flop
4                Talvar            24    22.0               Plus

In [44]:
unique_values = df['Box_Office_Verdict'].unique()
print(unique_values)

['Hit' 'Flop' 'Plus' 'Average' 'All Time Blockbuster' 'Super Hit'
 'Blockbuster' 'Disaster' 'Semi Hit']

In [45]:
# create instance of LabelEncoder to the data 

from sklearn.preprocessing import LabelEncoder

In [46]:
encoder = LabelEncoder()

In [47]:
encoded_data = encoder.fit_transform(df[['Box_Office_Verdict']])

In [48]:
encoded_df = pd.DataFrame(encoded_data , columns = ['Box_Office_Verdict'] )

encoded_df.head()

   Box_Office_Verdict
0                   5
1                   4
2                   4
3                   4
4                   6

In [49]:
unique_values = encoded_df['Box_Office_Verdict'].unique()
print(unique_values)

[5 4 6 1 0 8 2 3 7]

In [ ]:
# concatenate the Encoded and original Data 

dff = pd.concat([df,encoded_df],axis =1)
dff.head()

## Target Guided Ordinal Encoder 

- it is technique used to encode categorical variables  based on thier  relationship with  the target variable (output variable).
- this encoding techniques  is useful when we have a categorical varible with a large number of unique categories and we want to use this variable as a feature in our machine  learning Model ,

- in target Guided Ordinal Encoding we replace each category in categorical variable with a numerical values based on the mean or median  of the target variable for category.
- this creates a monotonic relationshipbetween the categorical variable and the target variable  which can imporove the predictive power of model

In [ ]:
# create a sample Dataframe with a categorical variable and target variable 

df = pd.DataFrame({'city':['New York' , 'London','Paris' ,'Tokyo' ,'New York','Paris'],
                  'Price': [200,300,450,180,306,295]})

In [ ]:
df.head()

In [ ]:
# calculate mean price of each city 

df.groupby('city')['Price'].mean()

In [ ]:
mean_price = df.groupby('city')['Price'].mean().to_dict()
mean_price

In [ ]:
# replace each city with its mean price 

df['City_encoded'] = df['city'].map(mean_price)

In [ ]:
df.head()

###### practice Set - 2

In [50]:
df = pd.read_excel('flight_price.xlsx')

In [51]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [52]:
df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [53]:
# claculate median price of each airline 

df.groupby('Airline')['Price'].mean()

Airline
Air Asia                              5590.260188
Air India                             9611.210616
GoAir                                 5861.056701
IndiGo                                5673.682903
Jet Airways                          11643.923357
Jet Airways Business                 58358.666667
Multiple carriers                    10902.678094
Multiple carriers Premium economy    11418.846154
SpiceJet                              4338.284841
Trujet                                4140.000000
Vistara                               7796.348643
Vistara Premium economy               8962.333333
Name: Price, dtype: float64

In [ ]:
mean_price = df.groupby('Airline')['Price'].mean().to_dict()

mean_price

In [ ]:
df['Airline_encode'] = df['Airline'].map(mean_price)

In [ ]:
df.head()

##### Data Encoding based on designation

In [ ]:
df.head()

In [ ]:
df.groupby('Destination')['Price'].mean()

In [ ]:
mean_price = df.groupby('Destination')['Price'].mean().to_dict()

mean_price

In [ ]:
df['Encoded_Destination'] = df['Destination'].map(mean_price)

In [ ]:
df.head()